{"format": "graph-model", "generatedBy": "2.6.2", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"image": {"name": "image:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "432"}, {"size": "48"}, {"size": "3"}]}}}, "outputs": {"rnn_output": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "25"}, {"size": "7482"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/CRNN/rnn_output/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/rnn_output/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/rnn_output/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/rnn_output/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/rnn_output/Tensordot/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "7482"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/Read/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "768"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/unstack-folded-0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/Read_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "768"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/unstack-folded-1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/ReverseV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "768"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/unstack-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/zeros/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/Read_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "768"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/unstack-folded-1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/Read/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "768"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/unstack-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/Read_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "768"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/unstack-folded-1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/ReverseV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/Read/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "768"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/unstack-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/zeros/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/Read_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "768"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/unstack-folded-1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/CRNN/reshape_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/reshape_1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/reshape_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/reshape_1/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/reshape_1/Reshape/shape/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/ReverseV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/ReverseV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/rnn_output/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/rnn_output/Tensordot/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/CRNN/rnn_output/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/rnn_output/Tensordot/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/CRNN/rnn_output/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7482"}]}}}}}, {"name": "image", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "432"}, {"size": "48"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/CRNN/block1_convbn/conv2d_18/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/block1_convbn/conv2d_18/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CRNN/block2_convbn/conv2d_19/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/block2_convbn/conv2d_19/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CRNN/block3_convbn1/conv2d_20/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/block3_convbn1/conv2d_20/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/block3_convbn2/conv2d_21/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CRNN/block3_convbn2/conv2d_21/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/block4_convbn1/conv2d_22/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/block4_convbn1/conv2d_22/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CRNN/block4_convbn2/conv2d_23/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/block4_convbn2/conv2d_23/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/block5_convbn1/conv2d_24/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/block5_convbn1/conv2d_24/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/block5_convbn2/conv2d_25/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/block5_convbn2/conv2d_25/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/while/enter/_230", "op": "Enter", "input": ["StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/Read/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQ1JOTi9iaWdydTIvZm9yd2FyZF9ncnVfMy9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/while/enter/_231", "op": "Enter", "input": ["ConstantFolding/StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/unstack-folded-0"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQ1JOTi9iaWdydTIvZm9yd2FyZF9ncnVfMy9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/while/enter/_232", "op": "Enter", "input": ["StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/Read_1/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQ1JOTi9iaWdydTIvZm9yd2FyZF9ncnVfMy9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/while/enter/_233", "op": "Enter", "input": ["ConstantFolding/StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/unstack-folded-1"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQ1JOTi9iaWdydTIvZm9yd2FyZF9ncnVfMy9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/while/enter/_225", "op": "Enter", "input": ["StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/time"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQ1JOTi9iaWdydTIvZm9yd2FyZF9ncnVfMy9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/while/enter/_223", "op": "Enter", "input": ["StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/while/loop_counter"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQ1JOTi9iaWdydTIvZm9yd2FyZF9ncnVfMy9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/while/enter/_290", "op": "Enter", "input": ["StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/Read/ReadVariableOp"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQ1JOTi9iaWdydTIvYmFja3dhcmRfZ3J1XzMvUGFydGl0aW9uZWRDYWxsL3doaWxl"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/while/enter/_291", "op": "Enter", "input": ["ConstantFolding/StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/unstack-folded-0"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQ1JOTi9iaWdydTIvYmFja3dhcmRfZ3J1XzMvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/while/enter/_292", "op": "Enter", "input": ["StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/Read_1/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQ1JOTi9iaWdydTIvYmFja3dhcmRfZ3J1XzMvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/while/enter/_293", "op": "Enter", "input": ["ConstantFolding/StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/unstack-folded-1"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQ1JOTi9iaWdydTIvYmFja3dhcmRfZ3J1XzMvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/while/enter/_285", "op": "Enter", "input": ["StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/time"], "attr": {"T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQ1JOTi9iaWdydTIvYmFja3dhcmRfZ3J1XzMvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/while/enter/_110", "op": "Enter", "input": ["StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/Read/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQ1JOTi9iaWdydTEvZm9yd2FyZF9ncnVfMi9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/while/enter/_111", "op": "Enter", "input": ["ConstantFolding/StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/unstack-folded-0"], "attr": {"parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQ1JOTi9iaWdydTEvZm9yd2FyZF9ncnVfMi9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/while/enter/_112", "op": "Enter", "input": ["StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/Read_1/ReadVariableOp"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQ1JOTi9iaWdydTEvZm9yd2FyZF9ncnVfMi9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/while/enter/_113", "op": "Enter", "input": ["ConstantFolding/StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/unstack-folded-1"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQ1JOTi9iaWdydTEvZm9yd2FyZF9ncnVfMi9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/while/enter/_105", "op": "Enter", "input": ["StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/time"], "attr": {"T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQ1JOTi9iaWdydTEvZm9yd2FyZF9ncnVfMi9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/while/enter/_103", "op": "Enter", "input": ["StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/while/loop_counter"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQ1JOTi9iaWdydTEvZm9yd2FyZF9ncnVfMi9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/while/enter/_170", "op": "Enter", "input": ["StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/Read/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQ1JOTi9iaWdydTEvYmFja3dhcmRfZ3J1XzIvUGFydGl0aW9uZWRDYWxsL3doaWxl"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/while/enter/_171", "op": "Enter", "input": ["ConstantFolding/StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/unstack-folded-0"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQ1JOTi9iaWdydTEvYmFja3dhcmRfZ3J1XzIvUGFydGl0aW9uZWRDYWxsL3doaWxl"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/while/enter/_172", "op": "Enter", "input": ["StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/Read_1/ReadVariableOp"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQ1JOTi9iaWdydTEvYmFja3dhcmRfZ3J1XzIvUGFydGl0aW9uZWRDYWxsL3doaWxl"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/while/enter/_173", "op": "Enter", "input": ["ConstantFolding/StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/unstack-folded-1"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQ1JOTi9iaWdydTEvYmFja3dhcmRfZ3J1XzIvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/while/enter/_165", "op": "Enter", "input": ["StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/time"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQ1JOTi9iaWdydTEvYmFja3dhcmRfZ3J1XzIvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/while/enter/_163", "op": "Enter", "input": ["StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/while/loop_counter"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQ1JOTi9iaWdydTEvYmFja3dhcmRfZ3J1XzIvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/while/enter/_283", "op": "Enter", "input": ["StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/while/loop_counter"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvQ1JOTi9iaWdydTIvYmFja3dhcmRfZ3J1XzMvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/CRNN/block1_convbn/re_lu_20/Relu", "op": "_FusedConv2D", "input": ["image", "StatefulPartitionedCall/CRNN/block1_convbn/conv2d_18/Conv2D_weights", "StatefulPartitionedCall/CRNN/block1_convbn/conv2d_18/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/while/merge/_241", "op": "Merge", "input": ["StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/while/enter/_230", "StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/while/next_iteration/_277"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/while/merge/_242", "op": "Merge", "input": ["StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/while/enter/_231", "StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/while/next_iteration/_278"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/while/merge/_243", "op": "Merge", "input": ["StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/while/enter/_232", "StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/while/next_iteration/_279"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/while/merge/_244", "op": "Merge", "input": ["StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/while/enter/_233", "StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/while/next_iteration/_280"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/while/merge/_236", "op": "Merge", "input": ["StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/while/enter/_225", "StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/while/next_iteration/_272"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/while/merge/_234", "op": "Merge", "input": ["StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/while/enter/_223", "StatefulPartitionedCall/CRNN/bigru2/forward_gru_3/PartitionedCall/while/next_iteration/_270"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/while/merge/_301", "op": "Merge", "input": ["StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/while/enter/_290", "StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/while/next_iteration/_337"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/while/merge/_302", "op": "Merge", "input": ["StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/while/enter/_291", "StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/while/next_iteration/_338"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/while/merge/_303", "op": "Merge", "input": ["StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/while/enter/_292", "StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/while/next_iteration/_339"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/while/merge/_304", "op": "Merge", "input": ["StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/while/enter/_293", "StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/while/next_iteration/_340"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/while/merge/_296", "op": "Merge", "input": ["StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/while/enter/_285", "StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/while/next_iteration/_332"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/while/merge/_121", "op": "Merge", "input": ["StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/while/enter/_110", "StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/while/next_iteration/_157"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/while/merge/_122", "op": "Merge", "input": ["StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/while/enter/_111", "StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/while/next_iteration/_158"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/while/merge/_123", "op": "Merge", "input": ["StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/while/enter/_112", "StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/while/next_iteration/_159"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/while/merge/_124", "op": "Merge", "input": ["StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/while/enter/_113", "StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/while/next_iteration/_160"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/while/merge/_116", "op": "Merge", "input": ["StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/while/enter/_105", "StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/while/next_iteration/_152"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/while/merge/_114", "op": "Merge", "input": ["StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/while/enter/_103", "StatefulPartitionedCall/CRNN/bigru1/forward_gru_2/PartitionedCall/while/next_iteration/_150"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/while/merge/_181", "op": "Merge", "input": ["StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/while/enter/_170", "StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/while/next_iteration/_217"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/while/merge/_182", "op": "Merge", "input": ["StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/while/enter/_171", "StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/while/next_iteration/_218"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/while/merge/_183", "op": "Merge", "input": ["StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/while/enter/_172", "StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/while/next_iteration/_219"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/while/merge/_184", "op": "Merge", "input": ["StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/while/enter/_173", "StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/while/next_iteration/_220"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/while/merge/_176", "op": "Merge", "input": ["StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/while/enter/_165", "StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/while/next_iteration/_212"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/while/merge/_174", "op": "Merge", "input": ["StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/while/enter/_163", "StatefulPartitionedCall/CRNN/bigru1/backward_gru_2/PartitionedCall/while/next_iteration/_210"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/while/merge/_294", "op": "Merge", "input": ["StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/while/enter/_283", "StatefulPartitionedCall/CRNN/bigru2/backward_gru_3/PartitionedCall/while/next_iteration/_330"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CRNN/block1_pool/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/CRNN/block1_convbn/re_lu_20/Relu"], "attr": {"explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/CRNN/block2_convbn/re_lu_21/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/CRNN/block1_pool/MaxPool", "StatefulPartitionedCall/CRNN/block2_convbn/conv2d_19/Conv2D_weights", "StatefulPartitionedCall/CRNN/block2_convbn/conv2d_19/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CRNN/block2_pool/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/CRNN/block2_convbn/re_lu_21/Relu"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/CRNN/block3_convbn1/re_lu_22/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/CRNN/block2_pool/MaxPool", "StatefulPartitionedCall/CRNN/block3_convbn1/conv2d_20/Conv2D_weights", "StatefulPartitionedCall/CRNN/block3_convbn1/conv2d_20/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/CRNN/block3_convbn2/re_lu_23/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/CRNN/block3_convbn1/re_lu_22/Relu", "StatefulPartitionedCall/CRNN/block3_convbn2/conv2d_21/Conv2D_weights", "StatefulPartitionedCall/CRNN/block3_convbn2/conv2d_21/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/CRNN/block3_pool/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/CRNN/block3_convbn2/re_lu_23/Relu"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/CRNN/block4_convbn1/re_lu_24/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/CRNN/block3_pool/MaxPool", 